'use strict'

danmaku = new Danmaku('#danmaku')
danmaku.add(new Comment('茜ちゃんをヒイヒイ言わせたい 突然の死', {color: '#ff4136', position: 3, size: 4}))
danmaku.add(new Comment('茜ちゃんをヒイヒイ言わせたい', {color: '#ffdc00', position: 1, size: 4}))
danmaku.add(new Comment('茜ちゃんをヒイヒイ言わせたい', {color: '#ffdc00', position: 1, size: 4}))
danmaku.add(new Comment('茜ちゃんをヒイヒイ言わせたい', {color: '#ffdc00', position: 1, size: 4}))
danmaku.add(new Comment('茜ちゃんをヒイヒイ言わせたい', {color: '#ffdc00', position: 1, size: 4}))
danmaku.add(new Comment('突然の死', {color: '#ffdc00', position: 1, size: 4}))
danmaku.add(new Comment('突然の死', {color: '#ffdcX" "00', position: 1, size: 4}))
danmaku.add(new ActionComment('突然の死', {color: 'cyan', position: 1, size: 4}))
infiniteDanmaku = new InfiniteDanmaku("test", danmaku, {tickDuration: 5000})


$('#add').on 'click', (e)->
  comments = [
    "　⊂(๏_๏⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂◠‿◠ฺ⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(º감º⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(✭‿✭∘⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(◜‿◝⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(☣ ‿ ☣⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(❤‿❤.⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(-_-..⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(☀‿☀⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(♛‿♛.⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(✺‿✺⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(❂‿❂⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂(◉◡◉⊂⌒｀つ≡ズザー㋻≡(´⌒;;;≡㋙≡(´⌒;;;≡㋡≡(´⌒;;;≡!!!!"
    "　⊂（ﾟДﾟ⊂⌒｀つ≡ズザー≡(´⌒;;;≡１コメ≡(´⌒;;;≡ゲトォォォオ≡(´⌒;;;≡≡!!!!"
    "　◁◘◙◘◙◘◙◘◙◘≪三三☁☁☁　◁◘◙◘◙◘◙◘◙◘≪三三☁☁☁　◁◘◙◘◙◘◙◘◙◘≪三三☁☁☁"
    "　◀■▓■▓■▓■▓■=ε3=ε◀■▓■▓■▓■▓■=ε3=ε◀■▓■▓■▓■▓■=ε3=ε◀■▓■▓■▓■▓■=ε3="
    "　◀ ■██■■██■██■██■ ≪三三☁☁ ◀■██■■██■██■██■≪三三☁☁"
    " ﾈﾀﾆﾏｼﾞﾚｽ(・∀・)ｶｺﾜﾙｲ!!"
    " (　ﾟ∀ﾟ)o彡°＠１!!"
    " ☑チェンジ"
    " ´∀｀"
    " ㋻㋙㋡"
    " ⊲⊰―㋻㋙㋡―≪"
    " 　▏▎▍▋▉　"
    " 　▉▋▍▎▏"
    " ↑age(∩´∀`)∩age↑"
    " (´∀｀∩)↑age↑"
    " q(ﾟдﾟ )Boooo↓"
    " 　(　´∀｀)bｸﾞｯ!!"
    " Σ(ﾟДﾟ)ｍｊｄ!?"
    " tmt（＾ω＾ ≡ ＾ω＾）おっおっ"
    " 　(＿´Д｀) アイーン"
    " (ﾟ∀ﾟ)ｱﾋｬ!!"
    " (=ﾟωﾟ)ﾉぃょぅ!!"
    " ヾ(ﾟДﾟ；)ぉぃぉぃ"
    " 　(´ε｀*)おちゅ❤"
    " （　＾ω＾）おっ"
    " （　＾ω＾）おつおっおっ"
    " ＼(^o^)／ｵﾜﾀ"
    " (,,ﾟДﾟ) ｶﾞﾝｶﾞﾚ!!"
    " ｷﾀ━(ﾟ∀ﾟ)━!!"
    " ｷﾃｰ━(´∀｀(⊃*⊂)━!!"
    " ヾ(*´∀｀*)ﾉｷｬｯｷｬｯ"
    " щ(ﾟДﾟщ)ｸﾚｸﾚ"
    " (＾∀＾)ｹﾞﾗｹﾞﾗ"
    " 　(ﾟДﾟ)ｺﾞﾙｧ!!"
    " :(；ﾞﾟ'ωﾟ'):ｻﾑｯ"
    " (ﾉД`)ｼｸｼｸ"
    " （´・ω・`）ｼｮﾎﾞｰﾝ"
    " ☆ﾁﾝ☆ﾁﾝ＼＿／＼＼（　・∀・）＜ﾏﾀﾞｰ"
    " (； ･`д･´)ﾅ、ﾅﾝﾀﾞｯﾃｰ!!"
    " (ヾﾉ･∀･`)ﾅｲﾅｲ"
    " （・∀・）ﾆﾔﾆﾔ!!"
    " ﾈﾀﾆﾏｼﾞﾚｽ(・∀・)ｶｺｲｲ!!"
    " (；´Д`)ｌ　＼ァｌ　＼ァ"
    " (　･ω･)つ≡つ ﾊﾞﾊﾞﾊﾞﾊﾞ"
    " ﾊﾞﾝ∩( ・ω・)∩ｼﾞｬｰｲ"
    " (；´Д｀)ﾊｧﾊｧ"
    " （#＾ω＾）ﾋﾟｷﾋﾟｷ"
    " (( ⊂⌒~⊃｡Д｡）⊃ ﾋﾟｸﾋﾟｸ"
    " ( ´_ゝ｀)ﾌｰﾝ"
    " 　( `_ゝ´)ﾌｫｫｰ!!"
    " （ ´,_ゝ｀）ﾌﾟｯ!!"
    " ヽ(`Д´)ﾉﾌﾟﾝｽｶﾌﾟﾝ"
    " (´・∀・｀)ﾍｰ"
    " 　( ﾟдﾟ )ﾎﾟｶｰﾝ"
    " ('A`)ﾏﾝﾄﾞｸｾ"
    " ヽ(｀Д´#)ﾉ ﾑｷｰ!!"
    " （*ﾟ∀ﾟ)=3ﾑｯﾊｧｰ!!"
    "  (ヾﾉ･∀･`)ﾑﾘﾑﾘ"
    "  (´Д⊂ﾓｳﾀﾞﾒﾎﾟ"
    "  (∩´∀`)∩ﾜｰｲ"
    "  　(｀･ω･´)ゞわこつですっ！"
    "  ┗(^o^ )┓　≡逝ｯﾃｸﾙ"
    "  地震ｷﾀ━(((ﾟ∀ﾟ)))━!!）)))))）))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))）"
  ]
  colors = new WeightedList [
    {value: '#ffffff', weight: 5}
    {value: '#ff4136', weight: 1}
    {value: '#0074D9', weight: 1}
  ]

  positions = new WeightedList [
    {value: 1, weight: 1}
    {value: 2, weight: 8}
    {value: 3, weight: 1}
  ]

  comment = new Comment(
    _.sample(comments),
    {position: positions.sample().value, size: _.sample([3,4]), color: colors.sample().value}
  )
  danmaku.add(comment)
